Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/money_and_tax/tax/income_tax/universal_social_charge.html.txt.tmx
Source language: en
Languages: ga

source: Universal Social Charge (USC)
ga: Muirear Sóisialta Uilíoch (MSU)

source: • Administration of the Universal Social Charge
ga: • Riarachán an Mhuirir Shóisialta Uilíoch

source: The Universal Social Charge (USC) is a tax on income that replaced both the income levy and the health levy (also known as the health contribution) since 1 January 2011
ga: Is cáin é an Muirear Sóisialta Uilíoch (MSU) a d’ionadaigh an tobhach ioncaim agus an tobhach sláinte (ar a dtugtar an ranníocaíocht sláinte freisin) araon ón 1 Eanáir 2011

source: You pay the USC if your gross income is more than €13,000 per year
ga: Íocann tú MSU má sháraíonn d’ioncam €13,000 sa bhliain

source: (This limit was €10,036 from 2012 to 2014 and €12,012 in 2015)
ga: (B'é an limistéar seo ná €10,036 idir 2012 agus 2014 agus €12,012 i 2015)

source: Once your income is over this limit, you pay the relevant rate of USC on all of your income
ga: Nuair atá d'ioncam thar an limistéar seo, íocann tú an ráta MSU cuí ar d'ioncam uile

source: It is calculated on a weekly or monthly basis
ga: Ríomhtar é ar bhonn seachtainiúil nó míosúil

source: It does not apply to social welfare or similar payments, and there are certain other exceptions: see 'Income exempt from the USC' below
ga: Ní bhaineann sé le híocaíochtaí leasa shóisialaigh nó a leithéid, agus tá eisceachtaí áirithe eile ann: féach "Ioncam díolmhaithe ón USC" thíos

source: Income liable for the USC
ga: Ioncam faoi dhliteanas i leith an MSU

source: The Universal Social Charge is payable on gross income, including notional pay (notional pay is the value of a non-cash benefit, such as benefit-in-kind), after any relief for certain capital allowances
ga: Tá an Muirear Sóisialta Uilíoch iníoctha ar ioncam comhlán, lena n-áirítear pá barúlach (is pá barúlach é an luach a bhaineann le sochar neamhairgid, mar shampla sochar comhchineáil), i ndiaidh aon fhaoiseamh ar liúntais chaipitil áirithe

source: The Universal Social Charge is payable on pension contributions
ga: Tá an Muirear Sóisialta Uilíoch iníoctha ar ranníocaíochtaí pinsin

source: You pay the Universal Social Charge if your gross income is more than €13,000 per year
ga: Íocann tú an Muirear Sóisialta Uilíoch má tá d'ioncam comhlán níos mó ná €13,000 in aghaidh na bliana

source: Once your income is over this limit, you pay the USC on all of your income
ga: Nuair atá d’ioncam níos mó ná an teorainn seo, íocann tú an MSU ar d’ioncam ar fad

source: For married couples or civil partners, each spouse or civil partner is treated individually by their employer or pension provider throughout the year
ga: I gcás lánúineacha pósta, caithfear le gach céile ina (h)aonar, ag a f(h)ostóir nó an soláthraí pinsin i rith na bliana

source: Liability for the USC depends on the date of the payment rather than on when the income was earned
ga: I gcás lánúineacha pósta nó páirtnéirí sibhialta, caitheann a bhfostóir nó a soláthróir pinsin le gach céile nó páirtnéir sibhialta ar bhealach aonair le linn na bliana

source: Although you may have no liability to income tax based on your entitlement to tax credits or by use of losses or capital allowances you may still have a liability to pay the Universal Social Charge on your income
ga: Cé go bhfuil an fhéidearthacht ann nach bhfuil dliteanas ar bith ort i leith cháin ioncaim atá bunaithe ar do theidlíocht chreidmheasanna cánacha nó trí úsáid a bhaint as cailleanna nó liúntais chaipitiúla, d’fhéadfadh a bheith dliteanas ort fós an Muirear Sóisialta Uilíoch a íoc ar d'ioncam

source: Some sources of income, for example, from occupation of certain woodlands, profits from stallion fees, stud greyhound services fees and farmland leasing, patent royalty income and earnings of certain writers, artists and composers, are exempt from income tax but are liable to the Universal Social Charge
ga: Tá roinnt foinsí ioncaim, ó áitíocht coillearnacha áirithe, mar shampla, brabúis áirithe ó tháillí staile, ó tháillí sheirbhísí na gcon agus léasú thalamh feirme, ó ioncam ríchíos paitinne agus tuilleamh scríbhneoirí, ealaíontóirí agus cumadóirí áirithe, díolmhaithe ó cháin ioncaim ach tá siad faoi dhliteanas ag an Muirear Sóisialta Uilíoch

source: Income exempt from the USC
ga: Ioncam díolmhaithe ón MSU

source: You do not pay the Universal Social Charge if your total income for a year is under €13,000
ga: Ní íocann tú an Muirear Sóisialta Uilíoch más rud é nach bhfuil d'ioncam iomlán do bhliain ar leith níos mó ná €13,000

source: (If you are aged 70 or over or a medical card holder aged under 70 and your aggregate income for the year is €60,000 or less you pay a reduced rate of USC.)
ga: (Má tá tú 70 bliain d’aois nó níos sine nó más sealbhóir cárta leighis thú agus más ionann do chomhioncam don bhliain agus €60,000 nó níos lú, íocann tú ráta laghdaithe den MSU.)

source: All Department of Social Protection payments, including Maternity Benefit, Paternity Benefit and State pensions, are exempt from the Universal Social Charge
ga: Tá gach íocaíocht na Roinne Coimirce Sóisialaí, lena n-áirítear Sochar Máithreachais, Sochar Atharthachta agus pinsin Stáit, díolmhaithe ón Muirear Sóisialta Uilíoch

source: Similar payments, such as payments made as part of Community Employment schemes or the Back to Education Allowance, are exempt
ga: Tá íocaíochtaí den chineál céanna, ar nós íocaíochtaí a rinneadh mar chuid de scéimeanna Fostaíochta Pobail nó den Liúntas chun Filleadh ar an Oideachas, díolmhaithe freisin

source: Social welfare or similar payments made from abroad are exempt. Student grants and scholarships are also exempt
ga: Tá leasa shóisialaigh nó íocaíochtaí cosúla a rinneadh ó thar lear díolmhaithe

source: Income where DIRT (Deposit Interest Retention Tax) has already been paid is exempt from the USC
ga: Tá ioncam i gcás ina bhfuil Cáin Choinneála ar Ús Taisce íoctha cheana díolmhaithe ón MSU

source: There are a number of other exemptions
ga: Tá roinnt díolúintí eile

source: • Certain salary sacrifice schemes, such as the TaxSaver Commuter Ticket Scheme and the Cycle to Work scheme
ga: • Scéimeanna íobairt tuarastail áirithe, mar shampla an Pas Taistil agus soláthar scéim rothair/trealamh rothair

source: • Rent a Room Relief
ga: • Faoiseamh Sheomra ar Cíos

source: There is a full list of exceptions in Revenue's Frequently Asked Questions document (pdf)
ga: Tá liosta iomlán eisceachtaí i ndoiciméad Ceisteanna Coitianta na gCoimisinéirí Ioncaim (pdf)

source: Statutory redundancy payments are exempt from the charge
ga: Tá íocaíochtaí iomarcaíochta reachtúla díolmhaithe ón táille

source: Statutory redundancy payments amount to 2 weeks’ pay per year of service plus a bonus week subject to a maximum payment of €600 per week
ga: Is ionann íocaíochtaí iomarcaíochta reachtúla agus pá dhá sheachtaine in aghaidh na bliana de sheirbhís móide seachtain bhónais faoi réir íocaíochta uasta de €600 in aghaidh na seachtaine

source: In addition, redundancy payments above the statutory redundancy amount are exempt from the Universal Social Charge, up to certain limits
ga: Ina theannta sin, tá íocaíochtaí iomarcaíochta níos mó ná an mhéid iomarcaíochta reachtúla díolmhaithe ón Muirear Sóisialta Uilíoch, suas go dtí teorainneacha áirithe

source: These limits are up to €10,160 plus €765 per complete year of service in excess of the statutory redundancy
ga: Tá na teorainneacha suas go dtí €10,160 móide €765 in aghaidh na bliana iomláine de sheirbhís de bhreis ar an iomarcaíocht reachtúla

source: This basic exemption can be further increased by up to €10,000 if the person is not a member of an occupational pension scheme
ga: Is féidir an díolúine bhunúsach seo a mhéadú arís, suas go dtí €10,000, mura bhfuil an duine ina bhall de scéim phinsean ceirde

source: The Universal Social Charge is charged on liable income after the statutory exemptions above, and after any additional deduction for Standard Capital Superannuation Benefit (SCSB)
ga: Tá an Muirear Sóisialta Uilíoch gearrtha ar an ioncam faoi dhliteanas i ndiaidh na ndíolúintí reachtúla thuas, agus i ndiaidh asbhaint bhreise ar bith le haghaidh Sochar Aoisliúntais Caipitiúil Caighdeánach (SACC)

source: How maintenance payments are treated for Universal Social Charge purposes depends on whether they are voluntary payments or legally enforceable payments
ga: Braitheann conas a dhéileálfar le híocaíochtaí cothabhála chun críche an Mhuirir Shóisialta Uilíoch ar cibé an bhfuil siad ina n-íocaíochtaí deonacha nó ina n-íocaíochtaí infhorghníomhaithe le dlí

source: Voluntary maintenance payments (payments paid under an informal arrangement):
ga: Íocaíochtaí cothabhála deonacha (íocaíochtaí a íocadh faoi chomhshocraíocht neamhfhoirmiúil):

source: • The spouse making the payments does not receive exemption from the Universal Social Charge on the portion of their income which they pay as maintenance
ga: • Ní fhaigheann an céile atá ag déanamh na n-íocaíochtaí díolúine ón Muirear Sóisialta Uilíoch ar chuid dá n-ioncam a íocann siad mar chothabháil

source: • The spouse who receives the payments is not subject to the Universal Social Charge on the maintenance payments they receive
ga: • Níl an céile a fhaigheann na híocaíochtaí faoi réir an Mhuirir Shóisialta Uilíoch ar na híocaíochtaí cothabhála a fhaigheann siad

source: Legally enforceable maintenance payments (payable under legal obligation):
ga: Íocaíochtaí infhorghníomhaithe le dlí (iníoctha faoi oibleagáid dhlíthiúil):

source: • The spouse making the payments is entitled to receive an exemption from the Universal Social Charge on the portion of their income on the maintenance they pay either directly or indirectly to their spouse
ga: • Tá an céile a dhéanann na híocaíochtaí i dteideal díolúine ón Muirear Sóisialta Uilíoch ar chuid dá n-ioncam ar chothabháil a íocann siad go díreach nó go hindíreach lena c(h)éile

source: There is no exemption for any portion of the maintenance payments paid towards the maintenance of children
ga: Níl aon díolúine d'aon chuid de na híocaíochtaí cothabhála a íoctar i leith chothabháil leanaí

source: • An employee wishing to claim Universal Social Charge exemption in respect of legally enforceable maintenance payments throughout the year may either give the information required to their payroll office, or alternatively they can apply to Revenue at the end of the year to claim any refund of Universal Social Charge due
ga: • Féadfar fostaí ar mian leis/léi díolúine Mhuirear Sóisialta Uilíoch a éileamh i leith íocaíochtaí cothabhála infhorghníomhaithe le dlí i rith na bliana, an fhaisnéis a cheanglaítear a thabhairt dá (h)oifig párolla, nó is féidir leis/léi iarratas a dhéanamh ar na Coimisinéirí Ioncaim ag deireadh na bliana chun aon aisíoc Mhuirear Sóisialta Uilíoch dlite a éileamh

source: • The spouse who receives the payments is subject to the Universal Social Charge on the portion of the maintenance payments they receive in respect of themselves
ga: • Tá an céile a fhaigheann na híocaíochtaí faoi réir an Mhuirir Shóisialta Uilíoch ar an gcuid de na híocaíochtaí cothabhála a fhaigheann sé/sí ina leith féin

source: Any portion of the maintenance payments paid towards the maintenance of children is not subject to the Universal Social Charge
ga: Níl aon chuid de na híocaíochtaí cothabhála a íoctar i leith chothabháil na leanaí faoi réir an Mhuirir Shóisialta Uilíoch

source: In the case of a legally enforceable maintenance arrangement, where a separated couple has jointly elected to be treated as a married couple for income tax purposes, the spouse making the payments does not receive exemption from the Universal Social Charge on the portion of their income which they pay as maintenance
ga: I gcás shocrú cothabhála infhorghníomhaithe le dlí, nuair a roghnaigh cúpla scartha i gcomhpháirt a bheith caite leo mar lánúin phósta chun críche cháin ioncaim, ní fhaigheann an céile a dhéanann na híocaíochtaí díolúine ón Muirear Sóisialta Uilíoch ar chuid dá (h)ioncam a íocann sé/sí mar chothabháil

source: The spouse who receives the payments is not subject to the Universal Social Charge on the maintenance payments they receive
ga: Níl an céile a fhaigheann na híocaíochtaí faoi réir an Mhuirir Shóisialta Uilíoch ar na híocaíochtaí cothabhála a fhaigheann siad

source: An employer’s or pension provider’s contribution to an approved retirement benefit scheme is not liable to the Universal Social Charge, but an employee's contributions are
ga: Níl ranníocaíocht fhostóra nó soláthraí pinsin don scéim um shochair scoir ceadaithe faoi dhliteanas i leith an Mhuirir Shóisialta Uilíoch, ach tá ranníocaíochtaí an fhostaí

source: From 1 January 2016, employer contributions to your Personal Retirement Savings Account (PRSA) are no longer subject to USC
ga: Ón 1 Eanáir 2016 ar aghaidh, níl ranníocaíochtaí fostóra le do Chuntas Coigiltis Scoir Pearsanta (CCSP) faoi réir MSU

source: Up to 31 December 2015, these contributions were subject to USC
ga: A fhad leis an 31 Nollaig 2015, bhí na ranníocaíochtaí seo faoi réir MSU

source: Occupational pensions are subject to the Universal Social Charge, but Department of Social Protection pensions or similar pensions from abroad are not
ga: Bíonn pinsin ghairme faoi réir an Mhuirir Shóisialta Uilíoch, ach ní bhíonn pinsin na Roinne Coimirce Sóisialaí nó pinsin dá samhail sin ó áiteanna thar lear faoi réir íoc as

source: The USC is only payable on lump sum pension payments on the portion over €500,000
ga: Tá an MSU iníoctha ar íocaíochtaí cnapshuime pinsin amháin ar an gcuid níos mó ná €500,000

source: If your income is €13,000 or less you pay no Universal Social Charge (USC)
ga: Más níos lú ná €13,000 d'ioncam, ní íocfaidh tú aon Mhuirear Sóisialta Uilíoch (MSU)

source: (This limit was €10,036 from 2012 to 2014 and €12,012 in 2015.) Once your income is over this limit, you pay the relevant rate of USC on all of your income
ga: A luaithe a bhíonn d’ioncam os cionn na teorann seo, íocann tú an ráta ábhartha de MSU ar d’ioncam go léir

source: For example, if you have income of €13,000 you will pay no USC
ga: Mar shampla, má tá ioncam €13,000 agat, ní íocfaidh tú aon MSU

source: If you have income of €13,001 you will pay 0.5% on income up to €12,012 and 2.5% on income between €12,012 and €13,001
ga: Má tá ioncam €13,001 agat, íocfaidh tú 0.5% ar ioncam a mhéid le €12,012 agus 2.5% ar ioncam idir €12,012 agus €13,001

source: Standard rate of USC (2017)
ga: Ráta caighdeánach an MSU (2017)

source: │Rate │Income band │
ga: │Ráta │Banda ioncaim │

source: │0.5% │Up to €12,012 │
ga: │0.5% │Ioncam suas go €12,012 │

source: │2.5% │From €12,012.01 to €18,772 │
ga: │2.5% │Idir €12,012.01 agus €18,772 │

source: │5% │From €18,772.01 to €70,044 │
ga: │5% │Idir €18,772.01 agus €70,044 │

source: │8% │From €70,044.01 to €100,000 │
ga: │8% │Idir €70,044.01 agus €100,000 │

source: │8% │Any PAYE income over €100,000 │
ga: │8% │Ioncam ÍMAT os cionn €100,000 │

source: │11% │Self-employed income over €100,000 │
ga: │11% │Ioncam féinfhostaithe os cionn €100,000 │

source: Reduced rate of USC (2017)
ga: Ráta laghdaithe an MSU (2017)

source: │0.5% │Income up to €12,012 │
ga: │0.5% │Ioncam suas go €12,012 │

source: │2.5% │All income over €12,012 │
ga: │2.5% │An t-ioncam go léir os cionn €12,012 │

source: Reduced rates of USC apply to:
ga: Bíonn rátaí laghdaithe an MSU i gceist sna cásanna a leanas:

source: • People aged 70 or over whose aggregate income for the year is €60,000 or less
ga: • Daoine os cionn 70 bliain d’aois nó a bhfuil a gcomhioncam don bhliain €60,000 nó níos lú

source: • Medical card holders aged under 70 whose aggregate income for the year is €60,000 or less
ga: • Sealbhóirí cárta leighis faoi bhun 70 bliain d’aois a bhfuil a gcomhioncam don bhliain €60,000 nó níos lú

source: Aggregate income for USC purposes does not include payments from the Department of Social Protection
ga: Ní áiríonn ‘Comhioncam’ ar mhaithe le cuspóirí an MSU íocaíochtaí ón Roinn Coimirce Sóisialaí

source: You must hold a full medical card (including a Health Amendment Act Card) to qualify for the reduced rate
ga: Ní mór go mbeidh cárta iomlán leighis agat (lena n-áirítear Cárta faoin Acht um Leasú Sláinte) chun cáiliú don ráta laghdaithe

source: People who hold a GP visit card, a Drugs Payment Scheme Card, a European Health Insurance Card or a Long-term Illness Scheme Card do not qualify for the reduced rate
ga: Ní cháilítear daoine ag a bhfuil Cárta Cuairte LG, Cárta faoin Scéim Íoctha Drugaí, Cárta Eorpach um Árachas Sláinte nó Cárta faoin Scéim Tinnis Fhadtéarmaigh don ráta laghdaithe

source: If a person reaches 70 years at any stage during the year they will benefit from the maximum 2.5% rate for the whole year
ga: Má bhaineann duine 70 bliain d’aois amach ag aon tráth le linn na bliana, bainfidh siad tairbhe ón ráta laghdaithe don bhliain go léir

source: People who hold Northern Ireland medical cards will no longer be treated as holding a full medical card and will therefore not qualify for a reduced rate
ga: In 2012, ní chaithfear le daoine ag a bhfuil cártaí leighis Thuaisceart Éireann amhail daoine ag a bhfuil cárta leighis iomlán agus ní cháileofaí iad don ráta 3.5%

source: Self-employed income over €100,000
ga: Ioncam ó fhéinfhostaíocht thar €100,000

source: A surcharge of 3% applies to people who have income from self-employment above €100,000, regardless of age
ga: Baineann táille bhreise 3% le daoine ag a bhfuil ioncam ó fhéinfhostaíocht atá os cionn €100,000, is cuma cén aois an duine sin

source: Note: Bonuses paid to employees of the 5 financial institutions that have received financial support from the State are chargeable to the USC at the rate of 45% on the full amount if the bonus is more than €20,000 in a single tax year
ga: Tabhair faoi deara: Tá bónais a íocadh le fostaithe de chuid na cúig institiúid airgeadais a bhfuair tacaíocht airgid ón Stát inchurtha mhuirir i leith an MSU ag an ráta de 45% ar an méid iomlán sa chás go bhfuil an bónas níos mó ná €20,000 in aon bhliain chánach amháin

source: A person who is earning €50,000 per year will pay the Universal Social Charge at a rate of 0.5% on the first €12,012 (which comes to €60.06), 2.5% on the next €6,760 (which comes to €169.00) and 5% on the balance of €31,228 (which comes to €1,561.40)
ga: Íocfaidh duine a thuilleann €50,000 sa bhliain an Muirear Sóisialta Uilíoch ar ráta 0.5% ar an gcéad € 12,012 (€60.06), 2.5% ar an chéad €6,760 (€169) agus 5% ar an iarmhéid de €31,228 (€1,561.40)

source: This person will pay €1,790.46 in 2017
ga: Íocfaidh an duine seo €1,790.46 sa bhliain ar an iomlán

source: You do not pay the Universal Social Charge if your total income for a year does not exceed €13,000
ga: Ní íocfaidh tú an Muirear Sóisialta Uilíoch mura sáraíonn d'ioncam iomlán do bhliain áirithe €13,000

source: For example, a person who is earning €13,000 per year will not pay any Universal Social Charge, while a person who is earning €13,100 per year will pay 0.5% on €12,012 (which comes to €60.06) and 2.5% on the remaining €1,088 which comes to €27.20)
ga: Mar shampla, ní íocfaidh duine a thuilleann €13,000 sa bhliain an Muirear Sóisialta Uilíoch, ach íocfaidh duine a thuilleann €13,100 sa bhliain0.5% ar an € 12,012 (a thagann chun €60.06) agus 2.5% de na fágtha €1,088 (€27.20)

source: This person will pay a total of €87.26 in the year
ga: Íocfaidh an duine seo €87.26 sa bhliain ar an iomlán

source: A person who has self-employed income of €112,000 per year, will pay the Universal Social Charge at a rate of 0.5% on the first €12,012 (which comes to €60.06), 2.5% on the next €6,760 (which comes to €169.00) 5% on the next €51,272 (which comes to €2,563.60), 8% on the next €29,956 (which comes to €2,396.48) and 11% on the next €12,000 (which comes to €1,320)
ga: Íocfaidh duine a bhfuil ioncam ó fhéinfhostaíocht €112,000 sa bhliain, an Muirear Sóisialta Uilíoch ar rátaráta de 0.5% ar an gcéad € 12,012 (€60.06), 2.5% ar an chéad €6,760 (€169) , 5% ar an chéad eile €51,272 (€2,536.60), 8% ar an chéad € 29,956 eile (€2,396.48) agus 11% ar an gcéad € 12,000 (€ 1,320)

source: In total this person will pay €6,509.14 in the year
ga: Íocfaidh an duine seo €6,509.14 sa bhliain

source: Administration of the Universal Social Charge
ga: Riarachán an Mhuirir Shóisialta Uilíoch

source: Universal Social Charge is deducted on a cumulative basis - similar to the way in which PAYE is deducted
ga: Asbhaintear Muirear Sóisialta Uilíoch ar bhonn carnach – cosúil leis an mbealach a asbhaintear ÍMAT

source: Employers and pension providers are responsible for deducting the Universal Social Charge from their employees’ salaries
ga: Tá fostóirí agus soláthraithe pinsin freagrach as an Muirear Sóisialta Uilíoch a asbhaint ó thuarastail a bhfostaithe

source: They deduct and pay it to Revenue on behalf of employees
ga: Déanann siad é a asbhaint agus a é leis na Coimisinéirí Ioncaim thar ceann fostaithe

source: Employer Tax Credit Certificates (P2Cs), as well as displaying PAYE rates and cut-off points, also show USC rates and cut-off points
ga: Déanann Deimhnithe Creidmheasa Cánach Fostóra (P2Canna), anuas ar rátaí agus scoithphointí ÍMAT a thaispeáint, rátaí agus scoithphointí MSU a thaispeáint

source: You should inform Revenue of any changes in your circumstances (for example, if you get a medical card) so your Tax Credit Certificate can be amended
ga: Ba cheart duit na Coimisinéirí Ioncaim a chur ar an eolas ar aon athruithe a thagann ar do chúinsí (mar shampla, má fhaigheann tú cárta leighis), d’fhonn gur féidir do Dheimhniú Creidmheasa Cánach a leasú

source: Details of the Universal Social Charge should be recorded separately on your payslip
ga: Ba cheart sonraí faoin Muirear Sóisialta Uilíoch a chur i dtaifead ar leithligh ar do dhuillín pá

source: The total amount of USC paid should be shown on your P60 each year
ga: Ba cheart an méid iomlán MSU a íocadh a thaispeáint ar do P60 gach bliain

source: If you change jobs your employer will give you a form P45
ga: Má athraíonn tú post, tabharfaidh d’fhostóir foirm P45 duit

source: This will show your pay, tax, USC, and PRSI details for the year up to the date you leave
ga: Taispeánfar air seo do phá, cáin, MSU agus sonraí ÁSPC don bhliain a fhad leis an dáta a fhágann tú

source: You should give this P45 to your new employer so that the correct amount of tax and USC is deducted from your pay
ga: Ba cheart duit an P45 seo a thabhairt do d’fhostóir nua ionas go n-asbhaintear an méid ceart cánach agus MSU ó do phá

source: Self-employed people make a payment of USC along with their preliminary tax payment, and any balance will be collected when the final assessment issues
ga: Déanann daoine féinfhostaithe íocaíocht MSU anuas ar a réamhíocaíocht cánach, agus baileofar aon iarmhéid nuair a eisítear an measúnú deiridh

source: For PAYE taxpayers, USC is deducted on a cumulative basis, similar to the way PAYE is deducted
ga: I dtaobh cáiníocóirí ÍMAT, asbhaintear an Muirear Sóisialta Uilíoch ar bhonn carnach, cosúil leis an mbealach a asbhaintear ÍMAT

source: This means that your USC deductions are spread out evenly over the year and the correct amount of USC is deducted at the end of the year
ga: Ciallaíonn seo go mbíonn d’asbhaintí MSU leata amach go cothrom i gcaitheamh na bliana agus go n-asbhaintear an méid ceart MSU ag deireadh na bliana

source: Overpayments of USC should not arise
ga: Níor cheart go ndéanfaí ró-íocaíochtaí MSU

source: If, however, at the end of the year you think you have overpaid USC, you can review your USC and tax on PAYE Anytime
ga: Má cheapann tú, áfach, ag deireadh na bliana, go ndearna tú an iomad MSU a íoc, féadfaidh tú do MSU agus do cháin a athbhreithniú ar ÍMAT Aon Tráth Aon Lá
